# -*- coding: utf-8 -*-
"""ААА дз Классы - Эрденко.ipynb

Automatically generated by Colaboratory.

Original file is located at
    https://colab.research.google.com/drive/1QfafSFi6RLaM9mf3hpEuekBQgrmva7wQ
"""

# -*- coding: utf-8 -*-
'''ААА дз Классы - Эрденко.ipynb

Automatically generated by Colaboratory.

Original file is located at
    https://colab.research.google.com/drive/1QfafSFi6RLaM9mf3hpEuekBQgrmva7wQ

Домашка 3 - выполнил Эрденко Александр

# Задание

Реализуйте класс CountVectorizer, имеющий
- метод fit_transform
- метод get_feature_names

Условия:
- пользоваться внешними пакетами запрещено
- решение должно быть в *.py файлах
- не должно быть замечаний PEP8
- решение загружено на github
- если умеешь, то напиши проверки/тесты
'''

class CountVectorizer:
  def fit_transform(self, corpus):
    words_list = []
    for text in corpus:
        words = text.lower().split()
        for word in words:
            if word not in words_list:
                words_list.append(word)

    self.feature_names = words_list
    feature_dict = {word: idx for idx, word in enumerate(self.feature_names)}

    count_matrix = []
    for text in corpus:
        words = text.lower().split()
        row = [0] * len(self.feature_names)
        for word in words:
            if word in feature_dict:
                row[feature_dict[word]] += 1
        count_matrix.append(row)

    return count_matrix

  def get_feature_names(self):
    return self.feature_names

'''# Тесты

Далее я описал несколько тест-кейсов: пример из задания, пример состоящий более чем из двух "строк", пример, в котором слова повторяются несколько раз, но в разном порядке
'''

def main() -> None:
    corpus = ['Crock Pot Pasta Never boil pasta again',
              'Pasta Pomodoro Fresh ingredients Parmesan to taste' ]

    vectorizer = CountVectorizer()
    count_matrix = vectorizer.fit_transform(corpus)

    print('Пример 1')
    print(vectorizer.get_feature_names())
    print(count_matrix)
    print(end ='\n')

    corpus1 = ['Всем моим братьям салам',
               'Салам всем моим братьям',
               'Я устал искать себе какую-то работу']

    vectorizer1 = CountVectorizer()
    count_matrix1 = vectorizer1.fit_transform(corpus1)

    print('Пример 2')
    print(vectorizer1.get_feature_names())
    print(count_matrix1)
    print(end ='\n')

    corpus2 = ['Идет медведь по лесу',
               'Видит, машина горит',
               'Сел в нее и сгорел']

    vectorizer2 = CountVectorizer()
    count_matrix2 = vectorizer2.fit_transform(corpus2)

    print('Пример 3')
    print(vectorizer2.get_feature_names())
    print(count_matrix2)
    print(end ='\n')

    corpus3 = ['3 крокодила',
               '2 крокодила',
               '2 бегемота',
               '2 крокодила и 3 бегемота']

    vectorizer3 = CountVectorizer()
    count_matrix3 = vectorizer3.fit_transform(corpus3)

    print('Пример 4')
    print(vectorizer3.get_feature_names())
    print(count_matrix3)
    print(end ='\n')

if __name__ == '__main__':
    main()